---
title: StructuralSectionIWideFlange
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWideFlange
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# StructuralSectionIWideFlange

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BoltDiameter { get; set; }` | `structuralSectionIWideFlange.BoltDiameter` | Double |
| `Double BoltSpacing { get; set; }` | `structuralSectionIWideFlange.BoltSpacing` | Double |
| `Double BoltSpacingBetweenRows { get; set; }` | `structuralSectionIWideFlange.BoltSpacingBetweenRows` | Double |
| `Double BoltSpacingTwoRows { get; set; }` | `structuralSectionIWideFlange.BoltSpacingTwoRows` | Double |
| `Double ClearWebHeight { get; set; }` | `structuralSectionIWideFlange.ClearWebHeight` | Double |
| `Double FlangeToeOfFillet { get; set; }` | `structuralSectionIWideFlange.FlangeToeOfFillet` | Double |
| `Double WebToeOfFillet { get; set; }` | `structuralSectionIWideFlange.WebToeOfFillet` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```